Revit 2027 API
ContinuousRailType.DefaultJoinOption Property
 The default join option between two rails.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RailTypeDefaultJoinOption DefaultJoinOption { get; set; }
Public Property DefaultJoinOption As RailTypeDefaultJoinOption
	Get
	Set
public:
property RailTypeDefaultJoinOption DefaultJoinOption {
	RailTypeDefaultJoinOption get ();
	void set (RailTypeDefaultJoinOption value);
}
member DefaultJoinOption : RailTypeDefaultJoinOption with get, set
Property Value
RailTypeDefaultJoinOption
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ContinuousRailType Class
Autodesk.Revit.DB.Architecture Namespace